Show / Hide Table of Contents
Class ProjectData
Defines certain data about user project.
Inheritance
System.Object
OpenObject
ProjectData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.ProjectData.ProjectData,CI.ProjectData", "CI.ProjectData.IProjectData,CI.BasicTypes")]
public sealed class ProjectData : OpenObject
Properties
Improve this Doc   View Source
Author
Gets or sets the project author.
Declaration
public string Author { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
CodeDependentData
Code dependent data
Declaration
public object CodeDependentData { get; set; }
Property Value
 Type |  Description
 System.Object
Improve this Doc   View Source
Date
Gets or sets the date.
Declaration
[OpenModelProperty("DateOfCreate")]
public DateTime Date { get; set; }
Property Value
 Type |  Description
 System.DateTime
Improve this Doc   View Source
Description
Gets or sets the description of project.
Declaration
public string Description { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Name
Gets or sets the name of project.
Declaration
[OpenModelProperty("ProjectName")]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Number
Gets or sets the number of project.
Declaration
[OpenModelProperty("ProjectNo")]
public string Number { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source